src/Reports/ВыгрузкаДоговорныхПозицийВФайл/ВыгрузкаДоговорныхПозицийВФайл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ВыгрузкаДоговорныхПозицийВФайл</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ДоговорныеПозиции/ДоговорныеПозиции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговорныеПозиции</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОстатокПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорнаяПозиция</name>
    <type>
      <types>CatalogRef.ДоговорныеПозиции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ВыгрузкаДоговорныхПозицийВФайл/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок = Новый ТабличныйДокумент;

Макет = Отчеты.ВыгрузкаДоговорныхПозицийВФайл.ПолучитьМакет("Макет");
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = Формат(Отчет.НаДату,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорныеПозиции.Владелец.Владелец КАК Контрагент,
	|	ДоговорныеПозиции.Владелец КАК Договор,
	|	ДоговорныеПозиции.Владелец.Валюта КАК ВалютаДоговора,
	|	ДоговорныеПозиции.МПЗ,
	|	ДоговорныеПозиции.МПЗ.Наименование КАК Наименование,
	|	ДоговорныеПозицииСрезПоследних.Период,
	|	ДоговорныеПозицииСрезПоследних.Количество,
	|	ДоговорныеПозицииСрезПоследних.Цена,
	|	ДоговорныеПозицииСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.ДоговорныеПозиции.СрезПоследних(&НаДату, ) КАК ДоговорныеПозицииСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ДоговорныеПозиции КАК ДоговорныеПозиции
	|		ПО ДоговорныеПозицииСрезПоследних.ДоговорнаяПозиция = ДоговорныеПозиции.Ссылка";
	Если СписокКонтрагентов.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " ГДЕ ДоговорныеПозиции.Владелец.Владелец В(&СписокКонтрагентов)";	
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
		Если Не ВалютаДоговора.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И ДоговорныеПозиции.Владелец.Валюта = &Валюта";	
		Запрос.УстановитьПараметр("Валюта", ВалютаДоговора);
		КонецЕсли;
	Иначе 
		Если Не ВалютаДоговора.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " ГДЕ ДоговорныеПозиции.Владелец.Валюта = &ВалютаДоговора";	
		Запрос.УстановитьПараметр("ВалютаДоговора", ВалютаДоговора);
		КонецЕсли;
	КонецЕсли; 
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Контрагент,Договор,Наименование";
Запрос.УстановитьПараметр("НаДату", Отчет.НаДату);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ОблСтрока.Параметры.Наименование = СокрЛП(ВыборкаДетальныеЗаписи.МПЗ.Наименование);
	ОблСтрока.Параметры.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
	ОблСтрока.Параметры.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
	ОблСтрока.Параметры.Договор = ВыборкаДетальныеЗаписи.Договор;
	ОблСтрока.Параметры.ВалютаДоговора = ВыборкаДетальныеЗаписи.ВалютаДоговора;
	ОблСтрока.Параметры.Количество = ВыборкаДетальныеЗаписи.Количество;
	ОблСтрока.Параметры.Цена = ВыборкаДетальныеЗаписи.Цена;
	ОблСтрока.Параметры.Валюта = ВыборкаДетальныеЗаписи.Валюта;
	ОблСтрока.Параметры.ДатаНачалаПоставки = Формат(ВыборкаДетальныеЗаписи.Период,"ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.НаДату = ТекущаяДата();
КонецПроцедуры
